<x-content>
    <div class="container">
        <p>
            Добро пожаловать в увлекательный мир нашего учебного проекта, где каждый имеет возможность создать уникальное объявление о съеме жилья!
        </p>
        <p>
            В процессе разработки мы успешно интегрировали два важных API: <a href="https://api.geotree.ru">Geotree API</a> и <a href="http://static.maps.2gis.com/">2GIS Maps API</a>. Эти инструменты позволяют пользователям подтвердить указанный адрес, преобразуя его в координаты широты и долготы. Затем вы сможете визуально оценить эти координаты в 2GIS и легко прикрепить к объявлению красочный снимок местности.
        </p>
        <p>
            Наши навыки в использовании шаблонизатора Blade в Laravel выросли, особенно в эффективном использовании компонентов. Это позволяет нам легко переиспользовать шаблоны при формировании уникальных представлений для каждой страницы.
        </p>
        <p>
            Проект также является примером успешной реализации паттерна MVC. Мы вынесли основную логику и запросы к базе данных из контроллера, разделив их между сервисами и моделями соответственно.
        </p>
        <p>
            Общий функционал включает в себя регистрацию, личный кабинет, создание объявлений, чат с хозяином жилья, административную панель, возможность подачи жалоб на объявления и многое другое!
        </p>
        <p>
            Если вы заинтересованы в деталях проекта, вы можете найти его <a href="https://github.com/Maxvell420/houses/tree/master">здесь на GitHub</a>.
        </p>
    </div>
</x-content>
