<?php
return [
    'create' => 'Создать заказ',
    'id' => 'Номер заказа',
    'status' => 'Статус',
    'payment' => 'Статус оплаты',
    'payed' => [0=>'Не оплачен',1=>'Оплачен'],
    'search' => 'Поиск заказа',
    'orderStatus' => [
        0=>'Подготовка заказа',
        1=>'Готов'],
    'price'=>'Итоговая цена',
    'order'=>'Заказ',
    'download'=>'Скачать файл',
    'changeStatus'=>'Изменить статус заказа',
    'changePayment'=>'Изменить статус оплаты',
    'orders'=>'Ваши заказы',
];
